//------------------------------------------------------------------------------
/// @file
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2018 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください。
//------------------------------------------------------------------------------
#pragma once
#include "OvenRecipe.hpp"

//------------------------------------------------------------------------------
namespace hpc {

//------------------------------------------------------------------------------
OvenRecipe::OvenRecipe()
: mWidth()
, mHeight()
{
}

//------------------------------------------------------------------------------
OvenRecipe::OvenRecipe(int aWidth, int aHeight)
: mWidth(aWidth)
, mHeight(aHeight)
{
}

//------------------------------------------------------------------------------
int OvenRecipe::width() const
{
    return mWidth;
}

//------------------------------------------------------------------------------
int OvenRecipe::height() const
{
    return mHeight;
}

//------------------------------------------------------------------------------
int OvenRecipe::area() const
{
    return width() * height();
}


} // namespace
// EOF
