//------------------------------------------------------------------------------
/// @file
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2018 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください。
//------------------------------------------------------------------------------
#pragma once

//------------------------------------------------------------------------------
#include <cstdio>

//------------------------------------------------------------------------------
/// 標準出力に文字列を出力する。
#define HPC_PRINTF(...) \
    do { std::printf(__VA_ARGS__); } while(false)

// EOF
